# Getting Started

## Listing 1-1 Unzipping dataset.zip

In [36]:
import zipfile
zip_ref = zipfile.ZipFile("C:/Users/eolivas/Box/H Drive Data/MISC/2020.08.24/Business Intelligence/Datasets/datasets.zip",'r')
zip_ref.extractall("C:/Users/eolivas/Box/H Drive Data/MISC/2020.08.24/Business Intelligence/Data Analysis with Python Excercises\datasets")
zip_ref.close()

#  Getting Data Into and Out of Python

## Listing 2-1 Loading data from CSV file

In [37]:
#normally, data will come to us as files or databse links. See listing 2-1 to learn how to load data from a CSV file

import pandas as pd
Location = "datasets/smallgradesh.csv"
df = pd.read_csv(Location, header=None)

##  Listing 2-2 Display First Five Lines of Data

In [31]:
df.head()

         0      1
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

as you can see our datafram lacks column headers. Or, rather, there are headers, but they weren't loeaded; they were loaded as row 1 of your data. To load data that includes headers, you can use the code shown in Listing 2-3

## Listing 2-3 Loading data from CSV File with headers

In [32]:
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd. read_csv(Location)

Then, as before, we take a look at what the data looks like by running the code shown Listing 2-4

## Listing 2-4 Display 1st five rows of data

In [34]:
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

If you have a dataset that doesn't include headers, you can add them
afterward. To add them, we can use one of the options shown in Listing 2-5.

## Listing 2-5 Loading Data from CSV File and Adding Headers

In [38]:
import pandas as pd
Location = "datasets/smallgrades.csv"
#To add headers as we load the data ...
df = pd.read_csv(Location, names=["Names", "Grades"])
#To add headers to a dataframe
df.columns = ["Names", "Grades"]

# Your Turn

### Creating a dataframe from the California dataset I downloaded as a CSV File

In [54]:
import pandas as pd
Location = "C:/Users/eolivas/Downloads/all_040_in_06.P1.csv"
df = pd.read_csv(Location)
df

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
0,6,40,6,NaN,NaN,NaN,NaN,NaN,California,37253956,13680081,33871648,12214549,37253956,33871648

### Saving Data to CSV
Maybe you want to save your progress when analyzing data. Maybe you are
just using Python to massage some data for later analysis in another tool.
Or maybe you have some other reason to export your dataframe to a CSV
file. The code shown in Listing 2-6 is an example of how to do this.

## Listing 2-6 Exporting a Dataset to CSV

In [40]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
GradeList = zip(names,grades)
df = pd.DataFrame(data = GradeList, columns=['Names','Grades'])
df.to_csv('studentgrades.csv',index=False,header=False)

## Listing 2-7 Getting help on to_csv

If you want in-depth information about the to_csv method, you can, of
course, use the code shown in Listing 2-7.

df.to_csv?

## Listing 2-8 Creating a Dataset for the Exercise

In [56]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]
Degrees = zip(names,grades,bsdegrees,msdegrees,phddegrees)
column = ['Names','Grades','BS','MS','PhD']
df = pd.DataFrame(data = Degrees, columns=column)
df

     Names  Grades  BS  MS  PhD
0      Bob      76   1   2    0
1  Jessica      95   1   1    1
2     Mary      77   0   0    0
3     John      78   0   0    0
4      Mel      99   1   0    0

## Your Turn
Export the dataframe in 2-8 to CSV

In [57]:
df.to_csv("studentDegrees.csv",index=False,header=False)

# Loading Data from Excel Files
Normally, data will come to us as files or database links. Let's see how to
load data from an Excel file (Listing 2-9).

## Listing 2-9 LoadingData from Excel File

In [58]:
import pandas as pd
Location = "datasets/gradedata.xlsx"
df = pd.read_excel(Location)

#Now, let's take a look at what our data looks like (Listing 2-10).

## Listing 2-10 Display first five lines of data

In [59]:
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

If you want to change/simplify columns names, just run the code in 2-11

##  Listing 2-11 Changing Column Names

In [60]:
df.columns = ['first','last','sex','age','exer','hrs','grd','addr']
df.head()

,first,last,sex,age,exer,hrs,grd,addr
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

# Your Turn
make a dataframe from a file downloaded from the following website:

https://www.census.gov/support/USACdataDownloads.html

In [64]:
import pandas as pd
Location = "C:/Users/eolivas/Downloads/VET01.xls"
df = pd.read_excel(Location)
df.head()

,Area_name,STCOU,VET010180F,VET010180D,VET010180N1,VET010180N2,VET010190F,VET010190D,VET010190N1,VET010190N2,...,VET310200N1,VET310200N2,VET320190F,VET320190D,VET320190N1,VET320190N2,VET320200F,VET320200D,VET320200N1,VET320200N2
0,UNITED STATES,0,0,28514544,0,0,0,27481055,0,0,...,0,0,0,1151044,0,0,0,1593254,0,0
1,ALABAMA,1000,0,432494,0,0,0,434787,0,0,...,0,0,0,17690,0,0,0,27689,0,0
2,"Autauga, AL",1001,0,3867,0,0,0,4225,0,0,...,0,0,0,299,0,0,0,385,0,0
3,"Baldwin, AL",1003,0,10333,0,0,0,14137,0,0,...,0,0,0,603,0,0,0,908,0,0
4,"Barbour, AL",1005,0,2248,0,0,0,2155,0,0,...,0,0,0,81,0,0,0,146,0,0